terraform apply -auto-approve
module.modules.iosxe_rest.bgp_example_patch: Refreshing state... [id=2645902358]
module.modules.iosxe_rest.bgp_example_delete: Refreshing state... [id=141054560]
module.modules.iosxe_rest.bgp_example_get: Refreshing state... [id=1554969011]
module.modules.iosxe_rest.acl_example_get_id: Refreshing state... [id=2318200609]
module.modules.iosxe_rest.bgp_example_post: Refreshing state... [id=151008753]
module.modules.iosxe_rest.acl_example_get: Refreshing state... [id=2312439396]
module.modules.iosxe_rest.acl_example_patch: Refreshing state... [id=3687808702]
module.modules.iosxe_rest.bgp_example_get_id: Refreshing state... [id=1948995312]
module.modules.iosxe_rest.bgp_example_put: Refreshing state... [id=3517091002]
iosxe_interface_loopback.loopback100: Refreshing state... [id=Cisco-IOS-XE-native:native/interface/Loopback=100]
iosxe_username.newusername: Refreshing state... [id=Cisco-IOS-XE-native:native/username=test]
iosxe_banner.example: Refreshing state... [id=Cisco-IOS-XE-native:native/banner]
iosxe_service.example: Refreshing state... [id=Cisco-IOS-XE-native:native/service]
iosxe_vrf.VRF-10: Refreshing state... [id=Cisco-IOS-XE-native:native/vrf/definition=VRF10]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # iosxe_service.example will be updated in-place
  ~ resource "iosxe_service" "example" {
      + dhcp                                    = (known after apply)
        id                                      = "Cisco-IOS-XE-native:native/service"
      + timestamps_debug                        = true
      + timestamps_debug_datetime               = true
      + timestamps_debug_datetime_localtime     = true
      + timestamps_debug_datetime_msec          = true
      + timestamps_debug_datetime_show_timezone = true
      + timestamps_debug_datetime_year          = true
      + timestamps_debug_uptime                 = true
      + timestamps_log                          = (known after apply)
      + timestamps_log_datetime                 = (known after apply)
      + timestamps_log_datetime_localtime       = (known after apply)
      + timestamps_log_datetime_msec            = (known after apply)
      + timestamps_log_datetime_show_timezone   = (known after apply)
      + timestamps_log_datetime_year            = (known after apply)
      + timestamps_log_uptime                   = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # iosxe_username.newusername will be updated in-place
  ~ resource "iosxe_username" "newusername" {
      + description         = (known after apply)
        id                  = "Cisco-IOS-XE-native:native/username=test"
        name                = "test"
      + password            = (known after apply)
      + password_encryption = (known after apply)
      ~ secret              = "$1$Tgauakjshdsldkjalskdj0" -> "test"
      ~ secret_encryption   = "5" -> "0"
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
iosxe_username.newusername: Modifying... [id=Cisco-IOS-XE-native:native/username=test
iosxe_service.example: Modifying... [id=Cisco-IOS-XE-native:native/service]
iosxe_username.newusername: Modifications complete after 0s [id=Cisco-IOS-XE-native:native/username=test]
╷
│ Error: Client Error
│ 
│   with iosxe_service.example,
│   on servises.tf line 2, in resource "iosxe_service" "example":
│    2: resource "iosxe_service" "example" {
│ 
│ Failed to configure object (PATCH), got error: HTTP Request failed: StatusCode 400, RESTCONF errors {Error:[{ErrorType:application ErrorTag:malformed-message ErrorAppTag: ErrorPath:/Cisco-IOS-XE-native:native/service
│ ErrorMessage:unknown element: debug-config in /ios:native/ios:service/ios:timestamps/ios:debug-config ErrorInfo:}]} {PatchId: GlobalStatus:{Ok:false Errors:{Error:[]}} EditStatus:{Edit:[]}}
